class UrlForTests:
    URL_MAIN_PAGE = 'https://qa-scooter.praktikum-services.ru/'

    #URL_ORDER_PAGE =

class Answers:
    answers_texts = [
        'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    ]

class OrderData:
    DATA = [
        {
            "name": "Вася",
            "surname": "Силач",
            "address": "Кокочалочка",
            "metro_option": "Лубянка",
            "phone_number": "+79876543456",
            "date": "01.01.2001",
            "start_date": "10.06.2025",
            "days": "сутки",
            "color": "black",
            "comment": "Леее куда гонишь",
        },
        {
            "name": "Жочкий",
            "surname": "Чел",
            "address": "Черкизон",
            "metro_option": "Черкизовская",
            "phone_number": "+79876543452",
            "date": "02.02.2002",
            "start_date": "12.06.2025",
            "days": "двое суток",
            "color": "grey",
            "comment": "",
        },
    ]